Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This page explains how to enable xDS gRPC usage in your Quarkus application.
ja_jp: このページでは、QuarkusアプリケーションでxDS gRPCの利用を有効にする方法について説明します。

source: This page explains how to start using gRPC in your Quarkus application. While this page describes how to configure it with Maven, it is also possible to use Gradle.
ja_jp: このページでは、QuarkusアプリケーションでgRPCを使い始める方法を説明します。このページではMavenでの設定方法を説明していますが、Gradleを使用することも可能です。

source: This page explains how to use gRPC CLI -- a grpcurl-like tool.
ja_jp: このページでは、grpcurlライクなツールであるgRPC CLIの使い方を説明します。

source: This page explains how to use gRPC CLI.
ja_jp: このページではgRPC CLIの使い方を説明します。

source: This page focuses on common features and the development model for all messaging extensions.
ja_jp: このページでは、すべてのメッセージングエクステンションに共通する機能と開発モデルに焦点を当てています。

source: This page is protected and can only be accessed by authenticated users.
ja_jp: このページは保護されており、認証されたユーザーのみがアクセスできます。

source: This page is protected, and only authenticated users can access it.
ja_jp: このページは保護されており、認証されたユーザーのみがアクセスできます。

source: This page lists all the Dev Services that Quarkus supports.
ja_jp: このページでは、QuarkusがサポートしているすべてのDev Servicesを紹介しています。

source: This page will appear alongside built-in menu items like "Configuration" or "Workspace."
ja_jp: このページは、「Configuration」や「Workspace」のような組み込みメニュー項目の横に表示されます。

source: This page will be loaded as the content for that tab in the settings dialog
ja_jp: このページは、設定ダイアログのそのタブのコンテンツとしてロードされます。

source: This page will be registered to the Router and can be navigated to by a normal link or using the Router:
ja_jp: このページはルーターに登録され、通常のリンクまたはルーターを使用して移動できます。

source: This page will explain what we mean by _Reactive_ and how Quarkus enables it. We will also discuss execution and programming models. Finally, we will list the Quarkus extensions offering reactive facets.
ja_jp: このページでは、 _リアクティブ_ とは何を意味するのか、またQuarkusがどのようにそれを可能にするのかを説明します。また、実行モデルとプログラミングモデルについても説明します。最後に、リアクティブな機能を提供するQuarkusのエクステンションの一覧を示します。

source: This parameter declaration overrides the declaration added by the global variable supplied by the `Globals#user()` method.
ja_jp: このパラメーター宣言は、`Globals#user()` メソッドが提供するグローバル変数によって追加される宣言を上書きします。

source: This part has nothing to do with GraalVM, it is how Quarkus starts frameworks “at build time”
ja_jp: この部分はGraalVMとは何の関係もありませんが、Quarkusがフレームワークを"ビルド時" に起動する方法です。

source: This part of the template will be cached and the `{service.findResult}` expression is only evaluated when a cache entry is missing/invalidated.
ja_jp: テンプレートのこの部分はキャッシュされ、キャッシュエントリーが見つからない、または無効になっている場合にのみ `{service.findResult}` 式が評価されます。

source: This particular feature was requested by a lot of users. With Quarkus, we tried to curate a validated list of Hibernate ORM that we want to expose and support in both JVM and native modes.
ja_jp: この特定の機能は、多くのユーザーから要望されていました。Quarkusでは、JVMとネイティブの両方のモードで公開し、サポートしたいHibernate ORMの有効なリストを作成しようとしました。

source: This path will be compared against the current request's path and the user will be logged out if these paths match.
ja_jp: このパスは現在のリクエストのパスと比較され、これらのパスが一致する場合、ユーザーはログアウトされます。

source: This path will be compared to the current request's path, and the user will be logged out if these paths match.
ja_jp: このパスは現在のリクエストのパスと比較され、これらのパスがマッチする 場合、ユーザはログアウトします。

source: This pattern allows your extension to: * compile against stable API types only, and * activate JFR instrumentation only when the Quarkus JFR extension is present in the application.
ja_jp: このパターンにより、エクステンションは次のことを行えます。 * 安定した API 型に対してのみコンパイルを行うこと。 * Quarkus JFR エクステンションがアプリケーションに存在する場合にのみ JFR インストルメンテーションをアクティブ化すること。

source: This pattern has multiple advantages, such as:
ja_jp: このパターンには、次のような複数の利点があります。

source: This permission references the built-in `deny` policy for `/forbidden`. This is an exact path match as it does not end with `*`.
ja_jp: このパーミッションは `/forbidden` に対する組み込みの `deny` ポリシーを参照します。これは `*` で終わらないので、完全なパスマッチとなります。

source: This permission references the built-in `deny` policy for both `/forbidden` and `/forbidden/` paths. It is an exact path match because it does not end with `*`.
ja_jp: この権限は、 `/forbidden` パスと `/forbidden/` パスの両方に対して組み込みの `deny` ポリシーを参照します。 これは `*` で終わっていないため、パスが完マッチします。

source: This permission references the default `permit` built-in policy to allow `GET` methods to `/public`. This is actually a no-op in this example, as this request would have been allowed anyway.
ja_jp: このパーミッションはデフォルトの `permit` ビルトインポリシーを参照して、 `/public` への `GET` メソッドを許可します。この例では、このリクエストはいずれにせよ許可されているはずなので、これは実際には no-op です。

source: This permission references the default built-in `permit` policy to allow `GET` methods to `/public`. In this case, the demonstrated setting would not affect this example because this request is allowed anyway.
ja_jp: この権限は、デフォルトの組み込み `permit` ポリシーを参照して、 `/public` への `GET` メソッドを許可します。 この場合、このリクエストはいずれにせよ許可されるため、示されている設定によるこの例への影響はありません。

source: This permission set references the previously defined policy. `roles1` is an example name; you can call the permission sets whatever you want.
ja_jp: この権限セットは、以前に定義されたポリシーを参照します。 `roles1` は例の名前です。権限セットには任意の名前を付けることができます。

source: This plugin is still experimental, it does not validate the extension dependencies as the equivalent Maven plugin does.
ja_jp: このプラグインはまだ実験的なもので、同等のMavenプラグインが行うようなエクステンションの依存関係の検証は行いません。

source: This policy denies all users.
ja_jp: このポリシーは、すべてのユーザーを拒否します。

source: This policy permits all users.
ja_jp: このポリシーは、すべてのユーザーを許可します。

source: This policy permits only authenticated users.
ja_jp: このポリシーは、認証されたユーザーのみを許可します。

source: This post briefly introduces SmallRye Stork and its Quarkus integration. Stork provides a way to locate and select services. It's simple and customizable. We will cover Stork features in more detail shortly.
ja_jp: この記事では、SmallRye StorkとそのQuarkus統合について簡単に紹介しました。Storkは、サービスを検索して選択する方法を提供します。シンプルでカスタマイズ可能です。Storkの機能の詳細については、近日中に詳しく説明します。

source: This post explains how you can generate and consume Cloud Events using Quarkus, Kafka, and Reactive Messaging.
ja_jp: この記事では、Quarkus、Kafka、Reactive Messagingを使用してクラウドイベントを生成して消費する方法を説明します。

source: This post gives some feedback on a particular challenge I have been facing in a professional context with respect to deploying applications on Kubernetes, and how we were able to provide a solution that met our goals using Quarkus.
ja_jp: この記事では、Kubernetes上でのアプリケーションのデプロイに関して、私が仕事上で直面している特定の課題について、Quarkusを使ってどのように目標を達成するソリューションを提供できたかについてフィードバックします。

source: This post is about the work we did in Quarkus and the libraries Quarkus relies on. But I would argue that the lessons we learned are applicable across the entire Java ecosystem.
ja_jp: この投稿は、Quarkus と Quarkus が依存するライブラリーで行った作業についてです。しかし、私たちが学んだ教訓は Java エコシステム全体に適用できるものだと私は考えています。

source: This post shows how you can use Stork in a Kubernetes environment to customize the service selection. While Kubernetes offers built-in service discovery and load-balancing, Stork adds another level of flexibility.
ja_jp: この記事では、Kubernetes環境でStorkを使用して、サービス選択をカスタマイズする方法を紹介しました。Kubernetesにはサービスディスカバリーとロードバランシングが組み込まれていますが、Storkはもう一段階の柔軟性を提供します。

source: This posts a Knative Event to the broker, which will trigger the `defaultChain` function. As discussed earlier, the output of `defaultChain` triggers an event that is posted to `configChain` which triggers an event posted to `annotatedChain` then finally to the `lastChainLink` function. You can see this flow in your `stern` window. Something like this should be outputted.
ja_jp: これは、ブローカーに Knative イベントをポストし、 `defaultChain` 関数をトリガーします。前述したように、 `defaultChain` の出力は、 `configChain` に投稿されたイベントをトリガーにして、 `annotatedChain` に投稿されたイベントをトリガーにして、最後に `lastChainLink` 関数をトリガーにします。この流れは `stern` ウィンドウで見ることができます。以下のようなものが出力されるはずです。

source: This procedure was formerly accomplished using the `@NativeImageTest` annotation. `@NativeImageTest` is considered deprecated in favor of `@QuarkusIntegrationTest` which provides a superset of the testing capabilities of `@NativeImageTest`. More information about `@QuarkusIntegrationTest` can be found in the xref:getting-started-testing.adoc#quarkus-integration-test[Testing Guide].
ja_jp: この手順は、以前は `@NativeImageTest` アノテーションを使用して実行されていました。 `@NativeImageTest` の廃止と、 `@NativeImageTest` のテスト機能のスーパーセットを提供する `@QuarkusIntegrationTest` の採用が検討されています。 `@QuarkusIntegrationTest` の詳細については、xref:getting-started-testing.adoc#quarkus-integration-test[アプリケーションのテスト] を参照してください。

source: This procedure was formerly accomplished using the `@NativeImageTest` annotation. `@NativeImageTest` was replaced by `@QuarkusIntegrationTest` which provides a superset of the testing capabilities of `@NativeImageTest`. More information about `@QuarkusIntegrationTest` can be found in the xref:getting-started-testing.adoc#quarkus-integration-test[Testing Guide].
ja_jp: この手順は、以前は `@NativeImageTest` のアノテーションを使用していました。 `@NativeImageTest` は `@QuarkusIntegrationTest` に置き換えられ、 `@NativeImageTest` のテスト機能のスーパーセットを提供します。 `@QuarkusIntegrationTest` の詳細については、 xref:getting-started-testing.adoc#quarkus-integration-test[テストガイド] を参照してください。

source: This process should consist of
ja_jp: このプロセスは次のように構成されています。

source: This producer is used to build the application to be tested. It uses Shrinkwrap to create a JavaArchive to test
ja_jp: このプロデューサーは、テストするアプリケーションを構築するために使用されます。Shrinkwrap を使用して、テストする JavaArchive を作成します。

source: This profile ensures that all Dev UI options described in <<develop-service-applications,Developing service applications>> are available when your `web-app` application is run in dev mode. The limitation of this approach is that both access and ID tokens returned with the code flow and acquired with Dev UI are sent to the endpoint as HTTP `Bearer` tokens - which does not work well if your endpoint requires the injection of `IdToken`. However, it works as expected if your `web-app` application only uses the access token, for example, as a source of roles or to get `UserInfo`, even if it is assumed to be a `service` application in dev mode.
ja_jp: このプロファイルによって、<<develop-service-applications,Developing service applications>> で説明されているすべての Dev UI オプションが、 `web-app` アプリケーションが開発モードで実行されているときに利用可能になります。 このアプローチの制限は、コードフローで返され、Dev UI で取得されたアクセストークンと ID トークンの両方が HTTP `Bearer` トークンとしてエンドポイントに送信されることです。これは、エンドポイントで `IdToken` の注入が必要な場合はうまく機能しません。 ただし、 `web-app` アプリケーションがアクセストークンを、たとえばロールのソースとして、または `UserInfo` を取得するためにのみ使用する場合は、開発モードの `service` アプリケーションであると想定される場合でも、期待どおりに機能します。

source: This profile is activated with the `jacoco` property.
ja_jp: このプロファイルは、`jacoco` プロパティーでアクティベートされます。

source: This project follows the <a href="#">all-contributors</a> specification. Contributions of any kind welcome!
ja_jp: このプロジェクトは <a href="#">all-contributors</a> 仕様に準拠しています。あらゆる種類の貢献を歓迎します！

source: This proof of identity, when you register, consists mostly in a public key. Actually there's a lot of stuff in there but the most interesting is the public key. This public key is not stored on your device, or your browser. It is generated especially for the target service (tied to its URI), and derived from the hardware authenticator. So the association of the hardware authenticator and the target service will always derive the same private and public key pair, none of which are stored anywhere. You can for example, take your YubiKey to another computer and it will keep generating the same private/public keys for the same target service.
ja_jp: この登録時のID証明は、ほとんどが公開鍵で構成されています。実際にはいろいろなものがありますが、最も興味深いのは公開鍵です。この公開鍵は、あなたのデバイスやブラウザに保存されているわけではありません。この公開鍵は、対象となるサービスのために特別に生成され（そのURIに関連付けられます）、ハードウェア認証デバイスから導出されたものです。したがって、ハードウェア認証デバイスとターゲットサービスの関連付けは、常に同じ秘密鍵と公開鍵のペアを導き出すことになります。例えば、YubiKeyを別のコンピュータに持ち出しても、同じターゲットサービスに対して同じ秘密鍵と公開鍵を生成し続けることができます。

source: This properties set should not be used in production.
ja_jp: このプロパティーセットは実稼働環境では使用しないでください。

source: This property can be set if a private decryption key's password in `KeyStore` is different from `smallrye.jwt.keystore.password` when `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
ja_jp: このプロパティーは、 `mp.jwt.decrypt.key.location` が `KeyStore` ファイルを指しているときに、 `KeyStore` 内の秘密復号化鍵のパスワードが `smallrye.jwt.keystore.password` と異なる場合に設定できます。

source: This property can be set if a private signing key's password in `KeyStore` is different from `smallrye.jwt.keystore.password` when `smallrye.jwt.sign.key.location` points to a `KeyStore` file.
ja_jp: このプロパティーは、 `smallrye.jwt.sign.key.location` が `KeyStore` ファイルを指しているときに、 `KeyStore` 内の秘密署名鍵のパスワードが `smallrye.jwt.keystore.password` と異なる場合に設定できます。

source: This property can be used in `application.properties` and in custom xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] if the tenant configurations are created dynamically.
ja_jp: このプロパティーは、`application.properties` および、テナント設定が動的に作成される場合はカスタムの xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] で使用できます。

source: This property can be used in `application.properties`, in xref:security-openid-connect-multitenancy.adoc[multi-tenant] set-ups if more than one provider has to be configured (for example, see https://docs.quarkiverse.io/quarkus-renarde/dev/security.html#_using_oidc_for_login[Quarkus Renarde security documentation]), in custom xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] if the tenant configurations are created dynamically.
ja_jp: このプロパティーは、 `application.properties`、複数のプロバイダーを設定する必要がある場合は xref:security-openid-connect-multitenancy.adoc[マルチテナント] セットアップ (たとえば、 https://docs.quarkiverse.io/quarkus-renarde/dev/security.html#_using_oidc_for_login[Quarkus Renarde セキュリティードキュメント]) を参照)、テナント設定が動的に作成される場合はカスタムの xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] で使用することができます。

source: This property can be used in `application.properties`, in xref:security-openid-connect-multitenancy.adoc[multi-tenant] set-ups if more than one provider has to be configured (for example, see https://quarkiverse.github.io/quarkiverse-docs/quarkus-renarde/dev/security.html#_using_oidc_for_login[Quarkus Renarde security documentation]), in custom xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] if the tenant configurations are created dynamically.
ja_jp: このプロパティーは、 `application.properties`、複数のプロバイダーを設定する必要がある場合は xref:security-openid-connect-multitenancy.adoc[multi-tenant] セットアップ (たとえば、 https://quarkiverse.github.io/quarkiverse-docs/quarkus-renarde/dev/security.html#_using_oidc_for_login[Quarkus Renarde security documentation]) を参照)、テナント設定が動的に作成される場合はカスタムの xref:security-openid-connect-web-multitenancy.adoc#tenant-config-resolver[TenantConfigResolvers] で使用することができます。

source: This property can be used to customize a `KeyStore` provider if `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
ja_jp: `mp.jwt.verify.publickey.location` または `mp.jwt.decrypt.key.location` が `KeyStore` ファイルを指している場合、このプロパティーを使用して `KeyStore` プロバイダーをカスタマイズできます。

source: This property can be used to customize a `KeyStore` provider if `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` point to a `KeyStore` file.
ja_jp: このプロパティは、 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` が `KeyStore` ファイルを指している場合に、 `KeyStore` プロバイダをカスタマイズするために使用できます。

source: This property can be used to customize a keystore type if either `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location` points to a `KeyStore` file. If it is not set, the file name is checked to determine the keystore type before defaulting to `JKS`.
ja_jp: このプロパティーは、 `mp.jwt.verify.publickey.location` または `mp.jwt.decrypt.key.location` のいずれかが `KeyStore` ファイルを指している場合に、キーストアタイプをカスタマイズするために使用できます。設定されていない場合は、ファイル名のチェックおよびキーストアタイプの決定が行われ、デフォルトで `JKS` に設定されます。

source: This property can be used to customize a keystore type if either `mp.jwt.verify.publickey.location` or mp.jwt.decrypt.key.location` points to a `KeyStore` file. If it is not set then the file name will be checked to determine the keystore type before defaulting to `JKS`.
ja_jp: `mp.jwt.verify.publickey.location` または `mp.jwt.decrypt.key.location` が `KeyStore` ファイルを指している場合、このプロパティーを使用してキーストアタイプをカスタマイズできます。設定されていない場合は、ファイル名がチェックされ、 `JKS` がデフォルトで設定される前にキーストアタイプが決定されます。

source: This property can be used to customize a keystore type if either `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` or both of these properties point to a `KeyStore` file. If it is not set then the file name will be checked to determine the keystore type before defaulting to `JKS`.
ja_jp: このプロパティは、 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` のいずれか、あるいはこれらのプロパティの両方が `KeyStore` ファイルを指している場合に、キーストアタイプをカスタマイズするために使用することができます。このプロパティが設定されていない場合、ファイル名をチェックしてキーストアの種類を決定し、デフォルトで `JKS` に設定されます。

source: This property can be used to set a default groups claim value when the current token has no standard or custom groups claim available.
ja_jp: このプロパティーを使用して、現在のトークンに使用可能な標準またはカスタムのグループクレームがない場合に、デフォルトのグループクレーム値を設定できます。

source: This property can be used to set a default sub claim value when the current token has no standard or custom `sub` claim available. Effectively this property can be used to customize `java.security.Principal` name if no `upn` or `preferred_username` or `sub` claim is set.
ja_jp: 現在のトークンに使用可能な標準またはカスタムの `sub` クレームがない場合に、このプロパティーを使用して、デフォルトのサブクレーム値を設定できます。事実上、このプロパティーを使用して、 `upn`、 `preferred_username`、 `sub`クレームが設定されていない場合に `java.security.Principal` 名をカスタマイズできます。

source: This property can set a default groups claim value when the current token has no standard or custom groups claim available.
ja_jp: このプロパティーでは、現在のトークンに使用可能な標準またはカスタムのグループクレームがない場合に、デフォルトのグループクレーム値を設定できます。

source: This property can set a default sub claim value when the current token has no standard or custom `sub` claim available. Effectively, this property can be used to customize the `java.security.Principal` name if no `upn` or `preferred_username` or `sub` claim is set.
ja_jp: 現在のトークンに使用可能な標準またはカスタムの `sub` クレームがない場合に、このプロパティーを使用して、デフォルトのサブクレーム値を設定できます。事実上、このプロパティーを使用して、 `upn`、 `preferred_username`、 `sub`クレームが設定されていない場合に `java.security.Principal` 名をカスタマイズできます。

source: This property combination works if your OIDC provider supports the metadata discovery.
ja_jp: このプロパティーの組み合わせは、OIDC プロバイダーがメタデータディスカバリーをサポートしている場合に機能します。

source: This property could be used to configure a custom local Maven repository directory, if it is different from the default one and the one specified in the `settings.xml`
ja_jp: これがデフォルトのものや `settings.xml`で設定されたものと異なる場合、このプロパティを使用して、カスタムのローカル Maven リポジトリ・ディレクトリを構成することができます。

source: This property has to be set to identify a private decryption key if `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `mp.jwt.decrypt.key.location` が `KeyStore` ファイルを指している場合、プライベートな復号鍵を特定するために設定する必要があります。

source: This property has to be set to identify a private signing key if `smallrye.jwt.sign.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `smallrye.jwt.sign.key.location` が `KeyStore` ファイルを指している場合、秘密署名鍵を特定するために設定する必要があります。

source: This property has to be set to identify a public encryption key which will be extracted from `KeyStore` from a matching certificate if `smallrye.jwt.encrypt.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `smallrye.jwt.encrypt.key.location` が `KeyStore` ファイルを指している場合、一致する証明書によって `KeyStore` から抽出される公開暗号鍵を特定するために設定される必要があります。

source: This property has to be set to identify a public verification key which is extracted from `KeyStore` from a matching certificate if `mp.jwt.verify.publickey.location` points to a `KeyStore` file.
ja_jp: このプロパティーは、 `mp.jwt.verify.publickey.location`が `KeyStore`ファイルを指している場合に、 `KeyStore` から抽出される公開検証鍵を一致する証明書から識別するために設定する必要があります。

source: This property has to be set to identify a public verification key which will be extracted from `KeyStore` from a matching certificate if `mp.jwt.verify.publickey.location` points to a `KeyStore` file.
ja_jp: このプロパティーは、 `mp.jwt.verify.publickey.location`が `KeyStore`ファイルを指している場合に、 `KeyStore` から抽出される公開検証鍵を一致する証明書から識別するために設定する必要があります。

source: This property is also enabled automatically if you have to <<verify-access-token-with-user-info>> or work with OAuth2 providers that do not return an ID token but a binary access token only that must be indirectly verified with `UserInfo`, see the <<id-token-availability>> section for more details.
ja_jp: この設定プロパティーは、 <<verify-access-token-with-user-info>> を行う必要がある場合や、ID トークンを返さず、 `UserInfo` で間接的に検証しなければならないバイナリアクセストークンのみを返す OAuth2 プロバイダーを使用する場合にも、自動的に有効になります。詳細は <<id-token-availability>> セクションを参照してください。

source: This property is optional - an empty `Optional` is injected if the configuration does not provide a value for `greeting.name`.
ja_jp: このプロパティーはオプションです - 設定が `greeting.name` の値を提供していない場合は、空の `Optional` が注入されます。

source: This property is required if the `service` application is expected to introspect the tokens remotely - which is always the case for the opaque tokens. This property is optional if the local Json Web Key token verification only is used.
ja_jp: このプロパティーは、 `service` アプリケーションがトークンをリモートで検査することが期待される場合に必要です。これは不透明なトークンの場合は常に当てはまります。ローカルの Json Web Key トークン検証のみが使用される場合、このプロパティーはオプションです。

source: This property is required if the `service` application is expected to introspect the tokens remotely, which is always the case for the opaque tokens. This property is optional for local JSON Web Token (JWT) verification only.
ja_jp: このプロパティーは、 `service` アプリケーションがトークンをリモートでイントロスペクトすることが予想される場合に必要です。これは、不透明トークンの場合は常に当てはまります。 このプロパティーは、ローカル JSON Web Token (JWT) 検証の場合にのみ省略可能です。

source: This property may be set if a private decryption key's password in `KeyStore` is different to `smallrye.jwt.keystore.password` when `mp.jwt.decrypt.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `mp.jwt.decrypt.key.location` が `KeyStore` ファイルを指しているときに、 `KeyStore` にある秘密鍵のパスワードが `smallrye.jwt.keystore.password` と異なる場合に設定されることがあります。

source: This property may be set if a private signing key's password in `KeyStore` is different to `smallrye.jwt.keystore.password` when `smallrye.jwt.sign.key.location` points to a `KeyStore` file.
ja_jp: このプロパティは、 `smallrye.jwt.sign.key.location` が `KeyStore` ファイルを指しているときに、 `KeyStore` にある秘密署名鍵のパスワードが `smallrye.jwt.keystore.password` と異なる場合に設定される場合があります。

source: This property may be useful to help the Maven resolver identify the top-level Maven project in the workspace. By default, the Maven resolver will be discovering a project's workspace by navigating the parent-module POM relationship. However there could be project layouts that are using an aggregator module which isn't appearing as the parent for its modules. In this case, this property will help the Quarkus Maven resolver to properly discover the workspace.
ja_jp: このプロパティーは、Maven リゾルバーがワークスペース内の最上位の Maven プロジェクトを識別する際に役立つ場合があります。デフォルトでは、Maven リゾルバーは、親モジュールの POM 関係をナビゲートすることによってプロジェクトのワークスペースを検出します。ただし、モジュールの親として表示されていないアグリゲーターモジュールを使用しているプロジェクトレイアウトが存在する可能性があります。この場合、このプロパティーは、QuarkusMaven リゾルバーがワークスペースを適切に検出できるようにサポートします。

source: This property may be useful to help the Maven resolver identify the top-level Maven project in the workspace. By default, the Maven resolver will be discovering a project's workspace by navigating the parent-module POM relationship. However, there could be project layouts that are using an aggregator module which isn't appearing as the parent for its modules. In this case, this property will help the Quarkus Maven resolver to properly discover the workspace.
ja_jp: このプロパティーは、Maven リゾルバーがワークスペース内の最上位の Maven プロジェクトを識別する際に役立つ場合があります。デフォルトでは、Maven リゾルバーは、親モジュールの POM 関係をナビゲートすることによってプロジェクトのワークスペースを検出します。ただし、モジュールの親として表示されていないアグリゲーターモジュールを使用しているプロジェクトレイアウトが存在する可能性があります。この場合、このプロパティーは、QuarkusMaven リゾルバーがワークスペースを適切に検出できるようにサポートします。
